## Pandas Day-4

In [6]:
import numpy as np

In [7]:
import pandas as pd

In [8]:
data={'Name':['sriram','santhosh',np.nan,'john','mohan','vikram'],'Age':[20,20,20,21,22,20],'Place':['Warangal','Khammam','Karimnagar','Nizambad','Adilabad','Hyderabad'],'marks':[78,np.nan,34,np.nan,45,np.nan]}

In [9]:
df=pd.DataFrame(data)

In [10]:
df

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [63]:
df.isnull().sum()

Name     1
Age      0
Place    0
marks    3
dtype: int64

In [11]:
df

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [12]:
df1=df

## Handling missing values

In [13]:
df1

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

### Dropping values

In [14]:
df1

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [15]:
df2=df1

In [16]:
df3=df2

In [17]:
df4=df3

In [18]:
df5=df4

In [19]:
df6=df5

In [20]:
df3

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [21]:
df6

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [22]:
df4

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [23]:
df1

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [24]:
# dropna() defaultly drop's rows which has missing values
df.dropna()

     Name  Age     Place  marks
0  sriram   20  Warangal   78.0
4   mohan   22  Adilabad   45.0

In [64]:
df

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [25]:
# dropna(axis='index',how='any')  drops row's which has missing values in row's
df.dropna(axis='index',how='any')

     Name  Age     Place  marks
0  sriram   20  Warangal   78.0
4   mohan   22  Adilabad   45.0

In [26]:
# dropna(axis='index',how='all') drop's all missing values in row's
df.dropna(axis='index',how='all')

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [27]:
# dropna(axis='columns',how='any') drops any missing values of columns
df.dropna(axis='columns',how='any')

   Age       Place
0   20    Warangal
1   20     Khammam
2   20  Karimnagar
3   21    Nizambad
4   22    Adilabad
5   20   Hyderabad

In [28]:
# dropna(axis='columns',how='all') drops columns when all the values of columns are null
df.dropna(axis='columns',how='all')

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [29]:
# dropna(axis='index',how='any',subset=['marks']) drop's rows if any value of that column is missing
df.dropna(axis='index',how='any',subset=['marks'])

     Name  Age       Place  marks
0  sriram   20    Warangal   78.0
2     NaN   20  Karimnagar   34.0
4   mohan   22    Adilabad   45.0

In [30]:
# dropna(axis='index',how='any',subset=['place','marks']) drop's rows if any of that columns contain missing values
df.dropna(axis='index',how='any',subset=['Place','marks'])

     Name  Age       Place  marks
0  sriram   20    Warangal   78.0
2     NaN   20  Karimnagar   34.0
4   mohan   22    Adilabad   45.0

### Replacing missing values

In [31]:
# Replacing missing values using fillna()
df

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [65]:
# filling missing values using fillna method
df.fillna(5)

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    5.0
2         5   20  Karimnagar   34.0
3      john   21    Nizambad    5.0
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    5.0

In [66]:
df

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [33]:
# Applying agregate functions in fillna method
mean=df['marks'].mean()
df['marks'].fillna(mean)

0    78.000000
1    52.333333
2    34.000000
3    52.333333
4    45.000000
5    52.333333
Name: marks, dtype: float64

In [34]:
median=df['marks'].median()
df['marks'].fillna(median)

0    78.0
1    45.0
2    34.0
3    45.0
4    45.0
5    45.0
Name: marks, dtype: float64

In [35]:
minimum=df['marks'].min()
df['marks'].fillna(minimum)

0    78.0
1    34.0
2    34.0
3    34.0
4    45.0
5    34.0
Name: marks, dtype: float64

In [36]:
maximum=df['marks'].max()
df['marks'].fillna(maximum)

0    78.0
1    78.0
2    34.0
3    78.0
4    45.0
5    78.0
Name: marks, dtype: float64

#### Using method parameter's
#####  1.ffill
#####  2.bfill

#### 1.ffill  : fills the missing values with value above to it

In [67]:
df

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [37]:
df.fillna(axis=0,method='ffill')

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam   78.0
2  santhosh   20  Karimnagar   34.0
3      john   21    Nizambad   34.0
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad   45.0

##### 2.bfill : fills the missing value with the value below to it

In [68]:
df

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [38]:
df.fillna(axis=0,method='bfill')

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam   34.0
2      john   20  Karimnagar   34.0
3      john   21    Nizambad   45.0
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [69]:
df

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [70]:
df.fillna(axis=0,method='ffill',limit=1)

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam   78.0
2  santhosh   20  Karimnagar   34.0
3      john   21    Nizambad   34.0
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad   45.0

### Casting Data types

In [71]:
df

       Name  Age       Place  marks
0    sriram   20    Warangal   78.0
1  santhosh   20     Khammam    NaN
2       NaN   20  Karimnagar   34.0
3      john   21    Nizambad    NaN
4     mohan   22    Adilabad   45.0
5    vikram   20   Hyderabad    NaN

In [40]:
df.dtypes

Name      object
Age        int64
Place     object
marks    float64
dtype: object

In [41]:
df['Age']=df['Age'].astype('float')

In [42]:
df.dtypes

Name      object
Age      float64
Place     object
marks    float64
dtype: object

In [43]:
df['Age']=df['Age'].astype('int')

In [44]:
df.dtypes

Name      object
Age        int32
Place     object
marks    float64
dtype: object

## Date and Time series

In [45]:
import numpy as np

In [46]:
import pandas as pd

In [47]:
a={'Date':['2020-03-13 08-PM','2020-03-13 07-PM','2020-03-13 06-PM','2020-03-13 05-PM','2020-03-13 04-PM','2020-03-13 05-PM'],'Name':['sriram','santhosh',np.nan,'john','mohan','vikram'],'Age':[20,20,20,21,22,20],'Place':['Warangal','Khammam','Karimnagar','Nizambad','Adilabad','Hyderabad'],'marks':[78,np.nan,34,np.nan,45,np.nan]}

In [48]:
dataframe=pd.DataFrame(a)

In [49]:
dataframe

               Date      Name  Age       Place  marks
0  2020-03-13 08-PM    sriram   20    Warangal   78.0
1  2020-03-13 07-PM  santhosh   20     Khammam    NaN
2  2020-03-13 06-PM       NaN   20  Karimnagar   34.0
3  2020-03-13 05-PM      john   21    Nizambad    NaN
4  2020-03-13 04-PM     mohan   22    Adilabad   45.0
5  2020-03-13 05-PM    vikram   20   Hyderabad    NaN

In [50]:
# Getting a particular date
dataframe.loc[0,'Date']

'2020-03-13 08-PM'

In [51]:
dataframe['Date'].dtypes

dtype('O')

In [52]:
# Converting str to datetime data type
dataframe['Date']=pd.to_datetime(dataframe['Date'],format='%Y-%m-%d %I-%p')

In [53]:
dataframe['Date']

0   2020-03-13 20:00:00
1   2020-03-13 19:00:00
2   2020-03-13 18:00:00
3   2020-03-13 17:00:00
4   2020-03-13 16:00:00
5   2020-03-13 17:00:00
Name: Date, dtype: datetime64[ns]

In [54]:
# getting day name for specific date of df
dataframe.loc[0,'Date'].day_name()

'Friday'

In [55]:
# Gives day name for all dates
dataframe['Date'].dt.day_name()

0    Friday
1    Friday
2    Friday
3    Friday
4    Friday
5    Friday
Name: Date, dtype: object

In [56]:
# Getting day of every date column and making it new column
dataframe['Day of week']=dataframe['Date'].dt.day_name()

In [57]:
dataframe

                 Date      Name  Age       Place  marks Day of week
0 2020-03-13 20:00:00    sriram   20    Warangal   78.0      Friday
1 2020-03-13 19:00:00  santhosh   20     Khammam    NaN      Friday
2 2020-03-13 18:00:00       NaN   20  Karimnagar   34.0      Friday
3 2020-03-13 17:00:00      john   21    Nizambad    NaN      Friday
4 2020-03-13 16:00:00     mohan   22    Adilabad   45.0      Friday
5 2020-03-13 17:00:00    vikram   20   Hyderabad    NaN      Friday

### min and max values

In [58]:
dataframe['Date'].min()

Timestamp('2020-03-13 16:00:00')

In [59]:
dataframe['Date'].max()

Timestamp('2020-03-13 20:00:00')

In [60]:
# Getting dates greater or equal to 2020
filt=(dataframe['Date'] >=
      '2020')
dataframe.loc[filt]

                 Date      Name  Age       Place  marks Day of week
0 2020-03-13 20:00:00    sriram   20    Warangal   78.0      Friday
1 2020-03-13 19:00:00  santhosh   20     Khammam    NaN      Friday
2 2020-03-13 18:00:00       NaN   20  Karimnagar   34.0      Friday
3 2020-03-13 17:00:00      john   21    Nizambad    NaN      Friday
4 2020-03-13 16:00:00     mohan   22    Adilabad   45.0      Friday
5 2020-03-13 17:00:00    vikram   20   Hyderabad    NaN      Friday

In [61]:
# getting dates greater than  to 2019 and and less than 2020
filt=((dataframe['Date']>'2019')&(dataframe['Date']<'2020'))
dataframe.loc[filt]

Empty DataFrame
Columns: [Date, Name, Age, Place, marks, Day of week]
Index: []